[
  {
    "id": 1,
    "year": "1920",
    "title": "Nguyễn Ái Quốc tiếp thu Chủ nghĩa Mác – Lênin",
    "description": "Xác định vai trò quyết định của Đảng cách mạng trong sự nghiệp giải phóng dân tộc và xây dựng niềm tin nhân dân.",
    "image": "/images/timeline/LeNin.jpg",
    "detailContent": {
      "context": "Năm 1920, Nguyễn Ái Quốc đọc 'Luận cương về vấn đề dân tộc và thuộc địa' của Lênin, từ đó chuyển biến tư tưởng từ yêu nước sang chủ nghĩa Mác-Lênin.",
      "significance": "Người khẳng định: 'Muốn cứu nước và giải phóng dân tộc không có con đường nào khác con đường cách mạng vô sản'. Đây là nền tảng để xây dựng Đảng chân chính, gắn bó với nhân dân.",
      "keyFigures": ["Nguyễn Ái Quốc (Hồ Chí Minh)"],
      "outcomes": [
        "Xác lập vai trò lãnh đạo của Đảng cách mạng",
        "Đặt nền móng tư tưởng xây dựng Đảng trong sạch, vì dân"
      ],
      "historicalContext": "Phong trào yêu nước Việt Nam bế tắc, cần đường lối mới.",
      "quote": "Chỉ có chủ nghĩa cộng sản mới cứu được nước ta và giải phóng dân tộc ta. - Hồ Chí Minh"
    }
  },
  {
    "id": 2,
    "year": "1930",
    "title": "Thành lập Đảng Cộng sản Việt Nam",
    "description": "Đảng ra đời với sứ mệnh vì dân, vì nước, đặt nền tảng cho mối quan hệ máu thịt Đảng - Dân.",
    "image": "/images/timeline/timeline1.jpg",
    "detailContent": {
      "context": "Ngày 3/2/1930, Hội nghị hợp nhất các tổ chức cộng sản thành Đảng Cộng sản Việt Nam dưới sự chủ trì của Nguyễn Ái Quốc.",
      "significance": "Hồ Chí Minh nhấn mạnh: Đảng không có lợi ích riêng, chỉ vì lợi ích của giai cấp công nhân và dân tộc. Đảng phải gần dân để giữ vững niềm tin.",
      "keyFigures": ["Hồ Chí Minh"],
      "outcomes": [
        "Xác lập bản chất giai cấp công nhân và tính nhân dân của Đảng",
        "Đặt nền tảng gắn bó máu thịt với nhân dân"
      ],
      "historicalContext": "Thống nhất phong trào cộng sản Việt Nam trong bối cảnh thuộc địa.",
      "quote": "Đảng ta là đạo đức, là văn minh. - Hồ Chí Minh"
    }
  },
  {
    "id": 3,
    "year": "1945",
    "title": "Đảng trở thành Đảng cầm quyền",
    "description": "Sau Cách mạng Tháng Tám, Đảng nắm chính quyền – quyền lực đặt ra nguy cơ tha hóa, quan liêu nếu không tự rèn luyện.",
    "image": "/images/timeline/timeline3.jpg",
    "detailContent": {
      "context": "Ngày 2/9/1945, Hồ Chí Minh đọc Tuyên ngôn Độc lập tại Quảng trường Ba Đình.",
      "significance": "Người cảnh báo sớm: Đảng cầm quyền dễ mắc bệnh quan liêu, tham ô, xa dân – dẫn đến mất lòng tin nhân dân.",
      "keyFigures": ["Hồ Chí Minh"],
      "outcomes": [
        "Nhận diện nguy cơ tha hóa quyền lực",
        "Đặt vấn đề xây dựng Đảng cầm quyền trong sạch"
      ],
      "historicalContext": "Chuyển từ đấu tranh giành chính quyền sang lãnh đạo Nhà nước non trẻ.",
      "quote": "Cán bộ là cái gốc của mọi công việc. - Hồ Chí Minh"
    }
  },
  {
    "id": 4,
    "year": "1947",
    "title": "Phê phán bệnh quan liêu, mệnh lệnh",
    "description": "Quan liêu là kẻ thù nội xâm, làm Đảng xa dân và mất lòng tin.",
    "image": "/images/timeline/timeline4.jpg",
    "detailContent": {
      "context": "Trong kháng chiến chống Pháp, Hồ Chí Minh phê phán mạnh mẽ bệnh quan liêu trong bộ máy.",
      "significance": "Quan liêu khiến dân mất niềm tin, cách mạng suy yếu. Người dạy: phải dân chủ, gần dân để giữ uy tín.",
      "keyFigures": ["Hồ Chí Minh"],
      "outcomes": [
        "Xác định quan liêu là nguy cơ lớn nhất của Đảng cầm quyền",
        "Đề cao phong cách gần gũi, lắng nghe dân"
      ],
      "historicalContext": "Bộ máy chính quyền mới dễ rơi vào hình thức, mệnh lệnh.",
      "quote": "Quan liêu là kẻ thù của nhân dân và của Đảng. - Hồ Chí Minh"
    }
  },
  {
    "id": 5,
    "year": "1952",
    "title": "Chống tham ô, lãng phí, tham nhũng",
    "description": "Tham nhũng là 'giặc nội xâm' nguy hiểm, trực tiếp làm Đảng mất uy tín và lòng tin nhân dân.",
    "image": "/images/timeline/timeline5.jpg",
    "detailContent": {
      "context": "Hồ Chí Minh phát động phong trào 'Cải cách ruộng đất' và chống tham ô, lãng phí.",
      "significance": "Người coi tham nhũng nguy hiểm hơn giặc ngoại xâm vì nằm trong nội bộ Đảng.",
      "keyFigures": ["Hồ Chí Minh"],
      "outcomes": [
        "Xây dựng nền tảng đạo đức công vụ",
        "Bảo vệ uy tín Đảng qua chống tiêu cực"
      ],
      "historicalContext": "Nhà nước mới, cán bộ nắm quyền lực và tài sản công.",
      "quote": "Tham ô, lãng phí là tội ác. - Hồ Chí Minh"
    }
  },
  {
    "id": 6,
    "year": "1958",
    "title": "Đạo đức cách mạng là gốc của người cán bộ",
    "description": "Cán bộ thoái hóa đạo đức sẽ dẫn đến Đảng suy yếu, mất lòng tin.",
    "image": "/images/timeline/timeline6.jpg",
    "detailContent": {
      "context": "Tác phẩm 'Đạo đức cách mạng' của Hồ Chí Minh.",
      "significance": "Có tài mà không có đức là người vô dụng. Đạo đức là nền tảng giữ Đảng trong sạch.",
      "keyFigures": ["Hồ Chí Minh"],
      "outcomes": [
        "Xây dựng chuẩn mực đạo đức cán bộ",
        "Chống chủ nghĩa cá nhân – nguồn gốc suy thoái"
      ],
      "historicalContext": "Xây dựng CNXH ở miền Bắc.",
      "quote": "Cần kiệm liêm chính, chí công vô tư. - Hồ Chí Minh"
    }
  },
  {
    "id": 7,
    "year": "1963",
    "title": "Lấy dân làm gốc",
    "description": "Mất lòng dân là mất tất cả – nền tảng tư tưởng giữ vững niềm tin nhân dân.",
    "image": "/images/timeline/timeline7.jpg",
    "detailContent": {
      "context": "Hồ Chí Minh khẳng định: 'Dân là gốc của nước'.",
      "significance": "Đảng tồn tại và phát triển nhờ lòng tin nhân dân. Xa dân là tự diệt.",
      "keyFigures": ["Hồ Chí Minh"],
      "outcomes": [
        "Củng cố mối quan hệ Đảng – Dân",
        "Phát huy dân chủ, lắng nghe dân"
      ],
      "historicalContext": "Kháng chiến chống Mỹ ác liệt.",
      "quote": "Có dân thì có tất cả, không có dân thì không có gì cả. - Hồ Chí Minh"
    }
  },
  {
    "id": 8,
    "year": "1969",
    "title": "Di chúc Hồ Chí Minh",
    "description": "Tổng kết tư tưởng: Xây dựng Đảng trong sạch là nhiệm vụ then chốt để giữ niềm tin nhân dân.",
    "image": "/images/timeline/timeline8.jpg",
    "detailContent": {
      "context": "Di chúc viết trước khi qua đời, là di sản tư tưởng lớn lao.",
      "significance": "Căn dặn Đảng phải thường xuyên tự chỉnh đốn, chống suy thoái để xứng đáng lãnh đạo.",
      "keyFigures": ["Hồ Chí Minh"],
      "outcomes": [
        "Định hướng lâu dài chỉnh đốn Đảng",
        "Cảnh báo nguy cơ mất lòng tin nếu không rèn luyện"
      ],
      "historicalContext": "Trước khi Bác qua đời.",
      "quote": "Đảng ta là một Đảng cầm quyền. Mỗi đảng viên và cán bộ phải thật sự thấm nhuần đạo đức cách mạng... - Hồ Chí Minh"
    }
  },
  {
    "id": 9,
    "year": "1986 (Đổi Mới)",
    "title": "Đảng cầm quyền trong kinh tế thị trường định hướng XHCN",
    "description": "Thách thức mới: Mặt trái thị trường gia tăng tham nhũng, lợi ích nhóm, đòi hỏi đổi mới xây dựng Đảng.",
    "image": "/images/timeline/timeline9.jpg",
    "detailContent": {
      "context": "Đại hội VI khởi xướng Đổi Mới.",
      "significance": "Đảng phải tự đổi mới để giữ vững vai trò lãnh đạo và niềm tin nhân dân.",
      "keyFigures": ["Đảng Cộng sản Việt Nam"],
      "outcomes": [
        "Tăng cường kiểm tra, giám sát cán bộ",
        "Chống tham nhũng trong bối cảnh mới"
      ],
      "historicalContext": "Hội nhập kinh tế quốc tế.",
      "quote": "Đổi mới không phải là thay đổi mục tiêu XHCN. - Hồ Chí Minh (tinh thần)"
    }
  },
  {
    "id": 10,
    "year": "Hiện Nay",
    "title": "Giữ vững niềm tin nhân dân – điều kiện sống còn",
    "description": "Chống tham nhũng quyết liệt, gần dân, vì dân để củng cố uy tín Đảng.",
    "image": "/images/timeline/timeline10.webp",
    "detailContent": {
      "context": "Bối cảnh toàn cầu hóa, chuyển đổi số, các thách thức mới.",
      "significance": "Niềm tin nhân dân là nền tảng sức mạnh Đảng. Phải kiên quyết chống tiêu cực.",
      "keyFigures": ["Đảng Cộng sản Việt Nam"],
      "outcomes": [
        "Đẩy mạnh phòng chống tham nhũng không vùng cấm",
        "Gần dân, lắng nghe, giải quyết bức xúc"
      ],
      "historicalContext": "Xây dựng Nhà nước pháp quyền XHCN.",
      "quote": "Đảng phải luôn xứng đáng là người đầy tớ trung thành của nhân dân. - Hồ Chí Minh"
    }
  }
]